In [1]:
import pandas as pd

In [2]:
summer_df = pd.read_csv('olympic-games/summer.csv')

In [3]:
summer_df.shape

(31165, 9)

In [4]:
summer_df.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [5]:
summer_df.tail()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
31160,2012,London,Wrestling,Wrestling Freestyle,"JANIKOWSKI, Damian",POL,Men,Wg 84 KG,Bronze
31161,2012,London,Wrestling,Wrestling Freestyle,"REZAEI, Ghasem Gholamreza",IRI,Men,Wg 96 KG,Gold
31162,2012,London,Wrestling,Wrestling Freestyle,"TOTROV, Rustam",RUS,Men,Wg 96 KG,Silver
31163,2012,London,Wrestling,Wrestling Freestyle,"ALEKSANYAN, Artur",ARM,Men,Wg 96 KG,Bronze
31164,2012,London,Wrestling,Wrestling Freestyle,"LIDBERG, Jimmy",SWE,Men,Wg 96 KG,Bronze

In [6]:
# 1. Which male athlete has won most medals ?
# 2. Which female athlete has won most medals ?
# 3. Which male & female athlete has won most gold ?
# 4. Which country has won most medals ?

In [7]:
male_df = summer_df[summer_df['Gender'] == 'Men']
female_df = summer_df[summer_df['Gender'] == 'Women']

In [8]:
pd.value_counts(male_df['Athlete']).head()

PHELPS, Michael         22
ANDRIANOV, Nikolay      15
MANGIAROTTI, Edoardo    13
ONO, Takashi            13
SHAKHLIN, Boris         13
Name: Athlete, dtype: int64

In [9]:
pd.value_counts(female_df['Athlete']).head()

LATYNINA, Larisa     18
FISCHER, Birgit      12
COUGHLIN, Natalie    12
THOMPSON, Jenny      12
TORRES, Dara         12
Name: Athlete, dtype: int64

In [10]:
male_gold = male_df[male_df['Medal'] == 'Gold']

In [11]:
male_gold.shape

(7698, 9)

In [12]:
pd.value_counts(male_gold['Athlete']).head()

PHELPS, Michael    18
SPITZ, Mark         9
LEWIS, Carl         9
NURMI, Paavo        9
KATO, Sawao         8
Name: Athlete, dtype: int64

In [13]:
pd.value_counts(summer_df['Country']).head()

USA    4585
URS    2049
GBR    1720
FRA    1396
GER    1305
Name: Country, dtype: int64

In [14]:
# 1. In which year India started playing olympics ?
# 2. In which sports India has won most medals ?
# 3. Which Indian athlete has won most gold ?

In [15]:
ind_df = summer_df[summer_df['Country'] == 'IND']

In [16]:
ind_df.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
241,1900,Paris,Athletics,Athletics,"PRITCHARD, Norman",IND,Men,200M,Silver
244,1900,Paris,Athletics,Athletics,"PRITCHARD, Norman",IND,Men,200M Hurdles,Silver
5512,1928,Amsterdam,Hockey,Hockey,"ALLEN, Richard James",IND,Men,Hockey,Gold
5513,1928,Amsterdam,Hockey,Hockey,"CHAND, Dyan",IND,Men,Hockey,Gold
5514,1928,Amsterdam,Hockey,Hockey,"GATELEY, Maurice A.",IND,Men,Hockey,Gold

In [17]:
pd.value_counts(ind_df['Sport'])

Hockey           169
Wrestling          4
Shooting           4
Boxing             2
Athletics          2
Weightlifting      1
Tennis             1
Badminton          1
Name: Sport, dtype: int64

In [33]:
medals = male_df.groupby(['Athlete', 'Medal'])['Sport'].count().reset_index().sort_values(by='Sport', ascending=False)

In [34]:
pd.unique(male_df['Medal'])

array(['Gold', 'Silver', 'Bronze'], dtype=object)

In [35]:
pd.unique(medals['Medal'])

array(['Gold', 'Silver', 'Bronze'], dtype=object)

In [36]:
medals.head()

               Athlete Medal  Sport
13732  PHELPS, Michael  Gold     18
16497      SPITZ, Mark  Gold      9
12769     NURMI, Paavo  Gold      9
10107      LEWIS, Carl  Gold      9
4838         EWRY, Ray  Gold      8

In [37]:
medals.drop_duplicates('Medal')

                Athlete   Medal  Sport
13732   PHELPS, Michael    Gold     18
18556  VORONIN, Mikhail  Silver      6
12428     NEMOV, Alexei  Bronze      6

In [38]:
summer_df['Athlete'].str.split(',').head()

0         [HAJOS,  Alfred]
1      [HERSCHMANN,  Otto]
2     [DRIVAS,  Dimitrios]
3    [MALOKINIS,  Ioannis]
4    [CHASAPIS,  Spiridon]
Name: Athlete, dtype: object

In [40]:
summer_df['Athlete'].str.split(',').str[::-1].head()

0         [ Alfred, HAJOS]
1      [ Otto, HERSCHMANN]
2     [ Dimitrios, DRIVAS]
3    [ Ioannis, MALOKINIS]
4    [ Spiridon, CHASAPIS]
Name: Athlete, dtype: object

In [41]:
summer_df['Athlete'].str.split(', ').str[::-1].str.join(' ').head()

0         Alfred HAJOS
1      Otto HERSCHMANN
2     Dimitrios DRIVAS
3    Ioannis MALOKINIS
4    Spiridon CHASAPIS
Name: Athlete, dtype: object

In [44]:
summer_df['Athlete'] = summer_df['Athlete'].str.split(', ').str[::-1].str.join(' ').str.title().head()

In [45]:
summer_df.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,Alfred Hajos,HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,Otto Herschmann,AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,Dimitrios Drivas,GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,Ioannis Malokinis,GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,Spiridon Chasapis,GRE,Men,100M Freestyle For Sailors,Silver

In [48]:
summer_df.groupby(['Country', 'Medal'])['Sport'].count().reset_index().sort_values(by='Sport', ascending=False).head()

    Country   Medal  Sport
327     USA    Gold   2235
328     USA  Silver   1252
326     USA  Bronze   1098
321     URS    Gold    838
322     URS  Silver    627

In [49]:
countries = summer_df.groupby(['Country', 'Medal'])['Sport'].count().reset_index().sort_values(by='Sport', ascending=False)

In [50]:
# Pivot Table / Long to Wide format

In [53]:
countries.pivot('Country', 'Medal', 'Sport').fillna(0).head()

Medal    Bronze  Gold  Silver
Country
AFG         2.0   0.0     0.0
AHO         0.0   0.0     1.0
ALG         8.0   5.0     2.0
ANZ         5.0  20.0     4.0
ARG        91.0  69.0    99.0

In [64]:
countries_pivot = countries.pivot('Country', 'Medal', 'Sport').fillna(0)

In [65]:
countries_pivot.sort_values(by='Gold', ascending=False).head()

Medal    Bronze    Gold  Silver
Country
USA      1098.0  2235.0  1252.0
URS       584.0   838.0   627.0
GBR       553.0   546.0   621.0
ITA       404.0   476.0   416.0
GER       475.0   452.0   378.0

In [66]:
countries_pivot = countries_pivot.sort_values(by='Gold', ascending=False)

In [67]:
countries_pivot['Total'] = countries_pivot.sum(axis=1).sort_values(ascending=False)

In [68]:
countries_pivot.head()

Medal    Bronze    Gold  Silver   Total
Country
USA      1098.0  2235.0  1252.0  4585.0
URS       584.0   838.0   627.0  2049.0
GBR       553.0   546.0   621.0  1720.0
ITA       404.0   476.0   416.0  1296.0
GER       475.0   452.0   378.0  1305.0